
// Χαρατηρισμοί Εσόδων Πρότυπων Παραστατικών ΑΑΔΕ
export class IncomeClassificationType {

    /**
     * Κωδικός Χαρακτηρισμού
      ** E3_106 = Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Εμπορεύματα
      ** E3_205 = Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά
      ** E3_210 = Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη
      ** E3_305 = Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις – Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά
      ** E3_310 = Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη
      ** E3_318 = Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Έξοδα παραγωγής
      ** E3_561_001 = Πωλήσεις αγαθών και υπηρεσιών Χονδρικές - Επιτηδευματιών
      ** E3_561_002 = Πωλήσεις αγαθών και υπηρεσιών Χονδρικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)
      ** E3_561_003 = Πωλήσεις αγαθών και υπηρεσιών Λιανικές - Ιδιωτική Πελατεία
      ** E3_561_004 = Πωλήσεις αγαθών και υπηρεσιών Λιανικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)
      ** E3_561_005 = Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Ενδοκοινοτικές
      ** E3_561_006 = Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Τρίτες Χώρες
      ** E3_561_007 = Πωλήσεις αγαθών και υπηρεσιών Λοιπά
      ** E3_562 = Λοιπά συνήθη έσοδα
      ** E3_563 = Πιστωτικοί τόκοι και συναφή έσοδα
      ** E3_564 = Πιστωτικές συναλλαγματικές διαφορές
      ** E3_565 = Έσοδα συμμετοχών
      ** E3_566 = Κέρδη από διάθεση μη κυκλοφορούντων περιουσιακών στοιχείων
      ** E3_567 = Κέρδη από αναστροφή προβλέψεων και απομειώσεων
      ** E3_568 = Κέρδη από επιμέτρηση στην εύλογη αξία
      ** E3_570 = Ασυνήθη έσοδα και κέρδη
      ** E3_595 = Έξοδα σε ιδιοπαραγωγή
      ** E3_596 = Επιδοτήσεις - Επιχορηγήσεις
      ** E3_597 = Επιδοτήσεις - Επιχορηγήσεις για επενδυτικούς σκοπούς - κάλυψη δαπανών
      ** E3_880_001 = Πωλήσεις Παγίων Χονδρικές
      ** E3_880_002 = Πωλήσεις Παγίων Λιανικές
      ** E3_880_003 = Πωλήσεις Παγίων Εξωτερικού Ενδοκοινοτικές
      ** E3_880_004 = Πωλήσεις Παγίων Εξωτερικού Τρίτες Χώρες
      ** E3_881_001 = Πωλήσεις για λογ/σμο Τρίτων Χονδρικές
      ** E3_881_002 = Πωλήσεις για λογ/σμο Τρίτων Λιανικές
      ** E3_881_003 = Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Ενδοκοινοτικές
      ** E3_881_004 = Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Τρίτες Χώρες
      ** E3_598_001 = Πωλήσεις αγαθών που υπάγονται σε ΕΦΚ
      ** E3_598_003 = Πωλήσεις για λογαριασμό αγροτών μέσω αγροτικού συνεταιρισμού κλπ
     */
    public classificationType?: 'E3_106' | 'E3_205' | 'E3_210' | 'E3_305' | 'E3_310' | 'E3_318' | 'E3_561_001' | 'E3_561_002' | 'E3_561_003' | 'E3_561_004' | 'E3_561_005' | 'E3_561_006' | 'E3_561_007' | 'E3_562' | 'E3_563' | 'E3_564' | 'E3_565' | 'E3_566' | 'E3_567' | 'E3_568' | 'E3_570' | 'E3_595' | 'E3_596' | 'E3_597' | 'E3_598_001' | 'E3_598_003' | 'E3_880_001' | 'E3_880_002' | 'E3_880_003' | 'E3_880_004' | 'E3_881_001' | 'E3_881_002' | 'E3_881_003' | 'E3_881_004';

    /**
     * Κατηγορία Χαρακτηρισμού
     ** category1_1 = Έσοδα από Πώληση Εμπορευμάτων (+) / (-)
     ** category1_2 = Έσοδα από Πώληση Προϊόντων (+) / (-)
     ** category1_3 = Έσοδα από Παροχή Υπηρεσιών (+) / (-)
     ** category1_4 = Έσοδα από Πώληση Παγίων (+) / (-)
     ** category1_5 = Λοιπά Έσοδα/ Κέρδη (+) / (-)
     ** category1_6 = Αυτοπαραδόσεις / Ιδιοχρησιμοποιήσεις (+) / (-)
     ** category1_7 = Έσοδα για λ/σμο τρίτων (+) / (-)
     ** category1_8 = Έσοδα προηγούμενων χρήσεων (+)/ (-)
     ** category1_9 = Έσοδα επομένων χρήσεων (+) / (-)
     ** category1_10 = Λοιπές Εγγραφές Τακτοποίησης Εσόδων (+) / (-)
     ** category1_95 = Λοιπά Πληροφοριακά Στοιχεία Εσόδων (+) / (-)
     ** category3 = Διακίνηση
     * */
    public classificationCategory: 'category1_1' | 'category1_2' | 'category1_3' | 'category1_4' | 'category1_5' | 'category1_6' | 'category1_7' | 'category1_8' | 'category1_9' | 'category1_10' | 'category1_95' | 'category3';


    public amount: number;


    public id?: number;


    [key: string]: any;


    public constructor(props?: IncomeClassificationType) {

        if (props) {

            this.classificationType = props.classificationType;
            this.classificationCategory = props.classificationCategory;
            this.amount = props.amount;
            this.id = props.id;
        }

    }

}
